Repository: kevindjf/tictacbet
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Training
fr: Entraînement

# trainingDescription
source: Practice without stakes
fr: Entraîne-toi sans risque

source: Competition
fr: Compétition

# competitionDescription
source: Bet coins and compete online
fr: Mise des coins et affronte des joueurs

source: vs AI
fr: vs IA

# vsLocal
source: vs Local Player
fr: vs Joueur local

source: Easy
fr: Facile

source: Medium
fr: Moyen

source: Hard
fr: Difficile

source: Difficulty
fr: Difficulté

source: Your turn!
fr: À toi de jouer !

# opponentTurn
source: Opponent's turn
fr: Tour de l'adversaire

# playerXTurn
source: Player X's turn
fr: Tour du joueur X

# playerOTurn
source: Player O's turn
fr: Tour du joueur O

source: You win!
fr: Victoire !

source: You lose!
fr: Défaite !

# draw
source: It's a draw!
fr: Égalité !

source: Player X wins!
fr: Joueur X gagne !

source: Player O wins!
fr: Joueur O gagne !

source: Play again
fr: Rejouer

source: Back to home
fr: Retour à l'accueil

# betAmount
source: Bet: {amount} coins
fr: Mise : {amount} coins

source: Balance
fr: Solde

source: Place Bet
fr: Miser

# minimumBet
source: Minimum bet: {amount}
fr: Mise minimum : {amount}

source: Insufficient balance
fr: Solde insuffisant

source: History
fr: Historique

source: Statistics
fr: Statistiques

source: No games yet
fr: Aucune partie jouée

source: Win rate
fr: Taux de victoire

source: Games played
fr: Parties jouées

source: Wins
fr: Victoires

source: Losses
fr: Défaites

source: Draws
fr: Égalités

source: Settings
fr: Paramètres

# rulesSectionTitle
source: Rules
fr: Règles

# rulesSectionIntro
source: Quick reminder of match outcomes:
fr: Rappel rapide des issues possibles d'une partie :

# rulesWinDescription
source: Align 3 of your symbols before your opponent.
fr: Aligne 3 de tes symboles avant ton adversaire.

# rulesLossDescription
source: Your opponent aligns 3 symbols before you.
fr: Ton adversaire aligne 3 symboles avant toi.

# rulesDrawDescription
source: The board is full and no player aligned 3 symbols.
fr: Le plateau est plein et personne n'aligne 3 symboles.

source: Theme
fr: Thème

# themeSystem
source: System
fr: Système

source: Dark mode
fr: Mode sombre

source: Light mode
fr: Mode clair

source: Language
fr: Langue

# languageEnglish
source: English
fr: Anglais

# languageFrench
source: French
fr: Français

source: Replay tutorial
fr: Rejouer le tutoriel

# replayTutorialConfirmTitle
source: Replay tutorial?
fr: Rejouer le tutoriel ?

# replayTutorialConfirmMessage
source: This will reset the tutorial progress and open onboarding again.
fr: Cela réinitialisera la progression du tutoriel et rouvrira l'onboarding.

source: Create Match
fr: Créer un match

# proposeMatch
source: Propose a match
fr: Proposer un match

# acceptMatch
source: Accept
fr: Accepter

# cancelMatch
source: Cancel
fr: Annuler

source: Waiting for opponent...
fr: En attente d'un adversaire...

source: Match accepted!
fr: Match accepté !

source: Simulate opponent
fr: Simuler un adversaire

# noProposals
source: No matches available
fr: Aucun match disponible

source: Log in
fr: Se connecter

source: Sign up
fr: S'inscrire

source: Password
fr: Mot de passe

source: Log out
fr: Se déconnecter

# welcomeTitle
source: Welcome to Tic Tac Bet!
fr: Bienvenue sur Tic Tac Bet !

# onboardingBoard
source: This is the board. Tap a cell to play.
fr: Voici le plateau. Touche une case pour jouer.

# onboardingGame
source: Take turns placing your marks to win!
fr: Joue à tour de rôle pour aligner 3 symboles !

source: Skip
fr: Passer

source: Next
fr: Suivant

source: Get started
fr: C'est parti

# readyToCompete
source: Ready to bet? Switch to competition!
fr: Prêt à miser ? Passe en compétition !

# selectMode
source: Select a mode
fr: Choisis un mode

source: Select difficulty
fr: Choisis la difficulté

source: Start Game
fr: Lancer la partie

source: Quit
fr: Quitter

source: Restart
fr: Recommencer

source: Won
fr: Gagné

source: Lost
fr: Perdu

# aiOpponent
source: AI ({difficulty})
fr: IA ({difficulty})

# localOpponent
source: Local Player
fr: Joueur local

# onlineOpponent
source: Online
fr: En ligne

# bankrupt
source: You're out of coins!
fr: Plus de coins !

# bailout
source: Here's {amount} coins to get back in the game!
fr: Voici {amount} coins pour revenir dans la partie !

# tutorialSimulationTitle
source: Let's play a game!
fr: On joue une partie !

# tutorialSimulationSubtitle
source: Follow the guide and tap the highlighted cells
fr: Suis le guide et touche les cases en surbrillance

# tutorialHint1Title
source: Place your X!
fr: Place ton X !

# tutorialHint1Body
source: Tap this cell to start your winning line along the top row.
fr: Touche cette case pour commencer ta ligne gagnante sur la ligne du haut.

# tutorialHint2Title
source: Extend your line!
fr: Prolonge ta ligne !

# tutorialHint2Body
source: One more X here — keep going!
fr: Encore un X ici — continue sur ta lancée !

# tutorialHint3Title
source: Win right here!
fr: Gagne ici !

# tutorialHint3Body
source: Complete the top row for a perfect victory!
fr: Complète la ligne du haut pour une victoire parfaite !

# tutorialVictoryTitle
source: You won your first game!
fr: Tu as gagné ta première partie !

# tutorialRewardSubtitle
source: Here are your 1,000 starting coins!
fr: Voilà tes 1 000 coins de départ !

# tutorialStartPlaying
source: Start playing!
fr: Jouer maintenant !

# cashBattleDesc
source: Bet your coins against real opponents.
fr: Mise tes coins contre de vrais adversaires.

# cashBattlePlay
source: Play (1.00€)
fr: Participer

# cyberBotDesc
source: Sharpen your skills against the AI.
fr: Affûte tes skills contre l'IA.

# cyberBotPlay
source: Challenge the Bot
fr: Défier le Bot

# duel1v1Tagline
source: Face to Face
fr: Face à Face

# duel1v1Desc
source: Two players, one screen, no mercy.
fr: Deux joueurs, un écran, sans pitié.

# duel1v1Play
source: Start the duel
fr: Lancer le duel
